Repository: mmaao/m-rtech
Catalog: source/locales/*/LC_MESSAGES/files.po
Languages: et_ee

source: Teleoperation
et_ee: Roboti juhtimine

source: Controlling the robot
et_ee: ROBOTONDI juhtimine

source: Setup
et_ee: Seadistamine

source: Install teleop twist keyboard
et_ee: Paigalda *teleop twist keyboard*

source: From your Android device, go to Google Play Store and install the `ROS Control app <https://play.google.com/store/apps/details?id=com.robotca.ControlApp&hl=en>`__.
et_ee: Ava enda Androidi seadmes Google Play pood ning paigalda `ROS Control app <https://play.google.com/store/apps/details?id=com.robotca.ControlApp&hl=en>`__.

source: Establish an ssh connection between the robot and the user PC as shown here: :ref:`connecting-remotely`.
et_ee: Loo roboti ja arvuti vahel ssh ühendus, nagu näidatud siin: :ref:`connecting-remotely`.

source: Start the driver
et_ee: Käivita draiver

source: Controlling the robot using teleop twist keyboard
et_ee: Roboti juhtimine *teleop twist keyboardi* abil

source: Open a new terminal window
et_ee: Ava uus terminali aken

source: Run the following command:
et_ee: Sisesta järgnev käsk:

source: Use the following keys to move the robot:
et_ee: Kasuta roboti liigutamiseks järgnevaid klahve:

source: From this point beyond, you are able to drive the robot with a keyboard. Should you loose control over the robot, do one of the following
et_ee: Sellest hetkest saab klahvivajutustega panna robotit eri suundades sõitma. Kui sa peaksid kaotama roboti üle kontrolli, tee üht järgnevatest:

source: PRESS "k" TO STOP THE ROBOT!
et_ee: ROBOTI PEATAMISEKS VAJUTA "k" KLAHVI!

source: PRESS THE EMERGENCY SWITCH ON THE ROBOT.
et_ee: VAJUTA ROBOTIL OLEVAT PUNAST E-STOP NUPPU.

source: Notice that the teleop node only receives keypresses only when the terminal window is active.
et_ee: Pane tähele, et klahvivajutused mõjuvad ainult siis kui terminaliaken on aktiivne.

source: Use :code:`CTRL + C` to stop the node.
et_ee: Sõlme peatamiseks kasuta :code:`CTRL + C`.

source: Controlling the robot using an Android device
et_ee: Roboti juhtimine Android seadmega

source: Open the ROS Control app on your phone
et_ee: Ava oma telefonis ROS Control rakendus

source: Click on "Show advanced options" in the prompted window and fill in "Joystick" and "Odometry" topic names with "robotont/cmd_vel" and "robotont/odom", respectively
et_ee: Vajuta avanenud aknal "Show advanced options" ja täida "Joystick" ja "Odometry" väljad järgnevalt: "robotont/cmd_vel" ja "robotont/odom"

source: Now you can select the robot from the list and teleoperate it using the touch joystick button
et_ee: Nüüd saad listist roboti valida ja seda liigutada, kasutades juhtkangi nuppu.

source: Controlling the simulated robot
et_ee: Simuleeritud roboti juhtimine

source: Make sure that fixed frame is set to "odom"!
et_ee: Veendu, et *fixed fame*'iks oleks määratud "odom"!

source: Find out your PC's ip-address
et_ee: Leia enda arvuti ip-aadress

source: or .. code-block:: bash
et_ee: või .. code-block:: bash

source: Insert your computer's IP address into Master URI field by entering the following:
et_ee: Sisesta enda arvuti IP aadress *Master URI* väljale

source: Click on "Show advanced options" in the prompted window and fill in "Joystick" and "Odometry" topic names with "cmd_vel" and "odom", respectively
et_ee: Vajuta avanenud aknal "Show advanced options" ja täida "Joystick" ja "Odometry" väljad järgnevalt: "robotont/cmd_vel" ja "robotont/odom"

source: Demos
et_ee: Demod

source: Before starting establish an ssh connection between the robot and the user PC as shown here: :ref:`connecting-remotely`.
et_ee: Enne alustamis loo roboti ja arvuti vahel ssh ühendus, nagu näidatud siin: :ref:`connecting-remotely`.

source: The following packages are needed to run the demos:
et_ee: Demode jooksutamiseks on vaja järgnevaid pakette:

source: For 2D mapping:
et_ee: 2D kaardistamise jaoks:

source: For 3D mapping:
et_ee: 3D kaardistamise jaoks:

source: For AR tracking:
et_ee: AR jälgimine

source: 2D mapping
et_ee: 2D kaardistamine

source: **On ROBOTONT on-board computer** launch 2d_nav_carto.launch
et_ee: **ROBOTONDI pardaarvutis launch 2d_nav_carto.launch*

source: **On the user PC** launch display_2d_mapping.launch to visualize the result
et_ee: **Kasutaja arvutis** launch display_2d_mapping.launch, et visualiseerida tulemus.

source: To move the robot open another terminal window **on the user PC** and run teleop twist keyboard
et_ee: Roboti liigutamiseks ava **kasutaja arvutis** uus terminaliaken ja jooksuta *teleop twist keyboard*

source: 3D mapping
et_ee: 3D kaardistamine

source: **On ROBOTONT on-board computer** launch 3d_mapping.launch
et_ee: **ROBOTONDI pardaarvutis** launch 3d_mapping.launch

source: **On the user PC** launch display_3d_mapping.launch to visualize the result
et_ee: **Kasutaja arvutis** launch display_3d_mapping.launch, et visualiseerida tulemus

source: AR tracking
et_ee: AR jälgimine

source: **On ROBOTONT on-board computer** launch ar_follow_the_leader.launch
et_ee: **ROBOTONDI pardaarvutis** launch ar_follow_the_leader.launch

source: **On the user PC** launch display_ar_marker.launch to visualize the result
et_ee: **Kasutaja arvutis** launch display_ar_marker.launch, et visualiseerida tulemus

source: Installing ROS
et_ee: ROSi installeerimine

source: Set up sources.list
et_ee: Seadista sources.list

source: Set up ROS keys
et_ee: Seadista ROS võtmed

source: Install ROS Melodic
et_ee: Installeeri ROS Melodic

source: Environment setup
et_ee: Keskkonna ülesse seadmine

source: Initialize rosdep
et_ee: Rosdepi initsialiseerimine

source: Overview
et_ee: Ülevaade

source: ClearBot’s depth camera gives the ability to see like humans and map the entire environment in 3D. With its omnidirectional wheels, the platform is free to move in any direction at any time. Its transparent design, extendable hardware, and open source software offer plenty of room for customized extensions. ClearBot is based on the most widely used software in robotics development called ROS (Robot Operating System). ROS gives open access to the latest software packages that are already used by worldwide known companies, such as, Boeing, Siemens, ABB, etc., and connects the industry with leading research institutions...
et_ee: ROBOTONDi sügavuskaamera võimaldab robotil näha nagu inimesed ja kaardistada kogu ümbritsev keskkond 3D-s. Omnirattad annavad vabaduse liikuda igal hetkel igas suunas. Roboti läbipaistev disain, laiendatav riistvara ja avatud lähtekoodiga tarkvara võimaldab robotit kohandada täpselt selliselt nagu endal soovi. ROBOTONT põhineb ROS-i(robot operating system) tarkvaral, mis on üks maailma enimkasutatavaid robootika raamistike. ROS tagab ligipääsu kõige uuematele tarkvarapakettidele, mida kasutatavad ka rohkem kui 60 ülemaailmselt tuntud ettevõtted nagu näiteks Boeing, Siemenes, ABB, Bosch jne. Samuti ühendab antud raamistik tööstused maailma juhtivate teadus organisatatsioonidega.

source: Specification
et_ee: Spetsifikatsioonid

source: `On-board computer - Intel NUC7i5BNK <https://www.intel.com/content/www/us/en/products/boards-kits/nuc/kits/nuc7i5bnk.html>`__
et_ee: `Pardaarvuti - Intel NUC7i5BNK <https://www.intel.com/content/www/us/en/products/boards-kits/nuc/kits/nuc7i5bnk.html>`__

source: Processor
et_ee: Protsessor

source: Peripherals
et_ee: Välissiinid

source: Storage
et_ee: Salvestusseade

source: Network
et_ee: Võrk

source: `Development board for external devices and motors- ARM NUCLEO-L476RG <https://os.mbed.com/platforms/ST-Nucleo-L476RG/>`__
et_ee: `Arendusplaat välisseadmetele ja mootoritele- ARM NUCLEO-L476RG <https://os.mbed.com/platforms/ST-Nucleo-L476RG/>`__

source: Debugging and programming interface
et_ee: Debugimise ja programmeerimise liides

source: Connectivity
et_ee: Ühenduvus

source: `Motors – DC motors with encoders <https://www.pololu.com/product/1442/specs/>`__
et_ee: `Mootorid - Koodritega alalisvoolumootorid <https://www.pololu.com/product/1442/specs/>`__

source: Voltage
et_ee: Pinge

source: Stall current
et_ee: Varisvool

source: Max rpm
et_ee: Max pöörded rpm

source: Max torque
et_ee: Max moment

source: Gear Ratio
et_ee: Ülekandearv

source: Encoder resolution (motor)
et_ee: Koodri resolutsioon (mootor)

source: 64 counts per revolution
et_ee: 64 lugemit pöörde kohta

source: Encoder resolution (gearbox)
et_ee: Koodri resolutsioon (käigukast)

source: 1200 counts per revolution
et_ee: 1200 lugemit pöörde kohta

source: `3D depth camera – Intel Realsense D435 <3D depth camera – Intel Realsense D435/>`__
et_ee: `3D sügavuskaamera – Intel Realsense D435 <3D depth camera – Intel Realsense D435/>`__

source: Depth Stream Output Resolution
et_ee: Sügavuskaamera resolutsioon

source: Depth Field of View horizontal
et_ee: Sügavuskaamera horisontaalne vaateväli

source: Depth Field of Vies vertical
et_ee: Sügavuskaamera vertikaalne vaateväli

source: RGB Sensor Resolution and Frame Rate
et_ee: RGB sensori resolutsioon ja kaadrisagedus

source: Minimum depth
et_ee: Min nägemisulatus

source: Max range
et_ee: Max nägemisulatus

source: Connection type
et_ee: Ühenduvus

source: connect the user PC to ROBOTONT's network or make sure that the user PC and ROBOTONT's on-board computer are connected to the same wifi router
et_ee: Ühenda kasutaja arvuti ROBOTONDI võrguga või veendu, et kasutaja arvuti ja ROBOTONDi pardaarvuti on ühendatud sama wifi ruuteriga

source: Run the following command and change the X with the number of your robot
et_ee: Jooksuta järgmist käsku ja vaheta X enda roboti numbri vastu

source: or
et_ee: või

source: Enter the password: t0ndik00bas
et_ee: Sisesta parool: t0ndik00bas

source: Sensors
et_ee: Andurid

source: ROBOTONT uses a Realsense D435 3D camera, which provides a regular camera feed and a depth sensor.
et_ee: ROBOTONT kasutab Realsense D435 3D kaamerat, millest saab tavalise kaamerapildi ja sügavuspildi.

source: The camera feed is launched automatically when the robot is turned on.
et_ee: Kaamera käivitub automaatselt, kui robot sisse lülitatakse

source: Displaying the camera feed
et_ee: Kaamerapildi kuvamine

source: Establish an ssh connection between the robot and the user PC as shown here: :ref:`connecting-remotely`
et_ee: Loo roboti ja arvuti vahel ssh ühendus, nagu näidatud siin: :ref:`connecting-remotely`.

source: **On the user PC** display the feed on RViz
et_ee: **Kasutaja arvutis** kuva pilt RVizis

source: Getting distances from objects
et_ee: Objektide kauguste saamine

source: Run laserscan_to_distance node
et_ee: Jooksuta laserscan_to_distance sõlme

source: To display the messages published to scan_to_distance
et_ee: Scan_to_distance sõlme sõnumite vaatamiseks

source: Installing Ubuntu
et_ee: Ubuntu installeerimine

source: Download and install Ubuntu Linux on your PC from the following link: `Ubuntu 18.04.4 LTS (Bionic Beaver) <http://releases.ubuntu.com/18.04.4/?_ga=2.170843936.1678816316.1594710587-1973467440.1591964081>`__.
et_ee: Lae järgnevalt lingilt alla ja installeeri enda arvutisse Ubuntu Linux: `Ubuntu 18.04.4 LTS (Bionic Beaver) <http://releases.ubuntu.com/18.04.4/?_ga=2.170843936.1678816316.1594710587-1973467440.1591964081>`__.

source: The guide to install Ubuntu on your PC can be found `here <https://ubuntu.com/tutorials/install-ubuntu-desktop#1-overview>`__.
et_ee: Juhendi Ubuntu installeerimiseks leiad `siit <https://ubuntu.com/tutorials/install-ubuntu-desktop#1-overview>`__.

source: Install Ros Melodic according to the following link: `Ros Melodic <http://wiki.ros.org/melodic/Installation/Ubuntu>`__.
et_ee: Installeeri Ros Melodic järgides järgnevalt lingilt leitavaid juhtnööre: `Ros Melodic <http://wiki.ros.org/melodic/Installation/Ubuntu>`__.

source: Establish an ssh connection (change the X with the ID written on the robot)
et_ee: Loo ssh ühendus (vaheta X enda roboti numbri vastu)

source: When logged in successfully, you can see that the terminal prompt has changed to kasutaja@clearbot-X. This will be an important reference when trying to figure out which terminal is connected to where.
et_ee: Eduka sisselogimise korral näed, et terminali viip on muutunud järgnevaks: kasutaja@clearbot-X. Selle järgi saad teha kindlaks, kumba terminali sa hetkel kasutad.

source: After logging into the robot, the ROS environment should be automatically sourced for you. You can quickly display the last lines of the file with tail ~/.bashrc command to examine which workspaces are sourced.
et_ee: Peale robotisse sisse logimist peaks ROSi keskkond automaatselt *source*'itud olema.

source: Simulation
et_ee: Simulatsioon

source: Launching the Simulation
et_ee: Simulatsiooni käivitamine

source: To launch the simulator and drive around:
et_ee: Simulatsiooni käivitamiseks ning ringi sõitmiseks

source: Mapping
et_ee: Kaardistamine

source: Launch the simulator
et_ee: Simulatsiooni käivitamine

source: Launch the gmapping software
et_ee: Käivita gmapping

source: Drive around using the keyboard and map the world
et_ee: Sõida ringi, kasutades klaviatuuri, ning kaardista maailm
